src/cf/Catalogs/СостоянияЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СостоянияЗаказовПокупателей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьРеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьСтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/СостоянияЗаказНарядов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СостоянияЗаказНарядов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ВидыЗаказНарядов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыЗаказНарядов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСостоянияВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСостоянияЗаявки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеВыполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказНарядов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказНарядов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокСостояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказНарядов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ВидыЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыЗаказовПокупателей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьДоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСостоянияЗаявки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеДоставлен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОжидаетОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОтгружен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокСостояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/РаботаСВидамиЗаказов/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ФормаЭлементаВидаЗаказаПриСозданииНаСервере(Форма) Экспорт 
	
	Объект     = Форма.Объект; 
	ЭтотОбъект = Форма.ЭтотОбъект; 
	Элементы   = Форма.Элементы;
	
	СостояниеЗавершен = СостояниеЗавершенИзВидаЗаказа(Объект.Ссылка);
	ОтборСтрок = Новый Структура("Состояние", СостояниеЗавершен);
	ЭтоВидЗаказНаряда = (ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ВидыЗаказНарядов"));
	
	СтрокаСостояниеЗавершен = Объект.ПорядокСостояний.НайтиСтроки(ОтборСтрок);
	ТаблицаСостояний = Объект.ПорядокСостояний;

	Если НЕ СтрокаСостояниеЗавершен.Количество() Тогда			
		
		НоваяСтрока = ТаблицаСостояний.Добавить();
		НоваяСтрока.Состояние = СостояниеЗавершен;
		НоваяСтрока.НаименованиеСостояния = СостояниеЗавершен.Наименование;
		НоваяСтрока.ЦветТекста = СостояниеЗавершен.Цвет.Получить();
		НоваяСтрока.ЦветФона = СостояниеЗавершен.ЦветФона.Получить();
		
	КонецЕсли;
	
	Если ЭтоВидЗаказНаряда Тогда
		ОписаниеТиповСостояния = Новый ОписаниеТипов("СправочникСсылка.СостоянияЗаказНарядов");
	Иначе
		ОписаниеТиповСостояния = Новый ОписаниеТипов("СправочникСсылка.СостоянияЗаказовПокупателей");
	КонецЕсли;
	
	ТЗПорядокСостояний = Новый ТаблицаЗначений;
	ТЗПорядокСостояний.Колонки.Добавить("Состояние", ОписаниеТиповСостояния);
	ТЗПорядокСостояний.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	Для Каждого СтрокаТаблицы Из ТаблицаСостояний Цикл
		СтрокаТЗ = ТЗПорядокСостояний.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтрокаТаблицы);
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗПорядокСостояний.Состояние КАК Состояние,
	|	ТЗПорядокСостояний.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ втПорядокСостояний
	|ИЗ
	|	&ТЗПорядокСостояний КАК ТЗПорядокСостояний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияЗаказовПокупателей.ПометкаУдаления КАК ПометкаУдаления,
	|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
	|	СостоянияЗаказовПокупателей.Цвет КАК Цвет,
	|	СостоянияЗаказовПокупателей.ЦветФона КАК ЦветФона,
	|	СостоянияЗаказовПокупателей.Предопределенный КАК Предопределенный,
	|	СостоянияЗаказовПокупателей.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	втПорядокСостояний.Состояние КАК Состояние,
	|	втПорядокСостояний.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	втПорядокСостояний КАК втПорядокСостояний
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
	|		ПО втПорядокСостояний.Состояние = СостоянияЗаказовПокупателей.Ссылка";
	
	Запрос.УстановитьПараметр("ТЗПорядокСостояний", ТЗПорядокСостояний);
	
	Если ЭтоВидЗаказНаряда Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВидыЗаказовПокупателей", "ВидыЗаказНарядов");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СостоянияЗаказовПокупателей", "СостоянияЗаказНарядов");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидЗаказа", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Состояние Из Результат Цикл
		СостояниеВТаблице = ТаблицаСостояний.НайтиСтроки(Новый Структура("Состояние", Состояние.Состояние));
		Для Каждого НайденноеСостояние Из СостояниеВТаблице Цикл
			Если Состояние.Цвет.Получить() <> Неопределено Тогда
				НайденноеСостояние.ЦветТекста = Состояние.Цвет.Получить();
			КонецЕсли;
			Если Состояние.ЦветФона.Получить() <> Неопределено Тогда
				НайденноеСостояние.ЦветФона = Состояние.ЦветФона.Получить();
			КонецЕсли;
			НайденноеСостояние.ПометкаУдаления = Состояние.ПометкаУдаления;
			НайденноеСостояние.НаименованиеСостояния = Состояние.Наименование;
		КонецЦикла;
	КонецЦикла;
	
	НесколькоВидовЗаказов = ПолучитьФункциональнуюОпцию("Использовать" + Объект.Ссылка.Метаданные().Имя); 
	
	Если НЕ НесколькоВидовЗаказов Тогда
		
		ЭтотОбъект.АвтоЗаголовок = Ложь;  
		
		Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ВидыЗаказовПокупателей") Тогда
			ЗаголовокФормы = НСтр("ru  = 'Состояния заказов покупателей'");
		Иначе
			ЗаголовокФормы = НСтр("ru  = 'Состояния заказ-нарядов'");
		КонецЕсли;
		ЭтотОбъект.Заголовок = ЗаголовокФормы;
		
		Элементы.Наименование.Видимость = Ложь;
		Элементы.Комментарий.Видимость = Ложь; 
		Элементы.ПорядокСостоянийДобавитьВсе.Видимость = Ложь;
		
		Элементы.ПорядокСостоянийКонтекстноеМенюУдалить.Видимость = Ложь;
		Элементы.ПорядокСостоянийУдалить.Видимость = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция СостояниеЗавершенИзВидаЗаказа(ВидЗаказа) Экспорт 

	Если ТипЗнч(ВидЗаказа) = Тип("СправочникСсылка.ВидыЗаказовПокупателей") Тогда
	
		СостояниеЗавершен = Справочники.СостоянияЗаказовПокупателей.Завершен;	
	
	ИначеЕсли ТипЗнч(ВидЗаказа) = Тип("СправочникСсылка.ВидыЗаказНарядов") Тогда
		
		СостояниеЗавершен = Справочники.СостоянияЗаказНарядов.Завершен;
	
	КонецЕсли;
	
	Возврат СостояниеЗавершен;

КонецФункции

Процедура СостояниеЗаказовПередУдалением(Состояние) Экспорт
	
	ЭтоСостояниеЗаказНарядов = ЭтоСостояниеЗаказНарядов(Состояние);
	
	Если ЭтоСостояниеЗаказНарядов Тогда
		ИспользоватьВиды = ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказНарядов");
	Иначе
		ИспользоватьВиды = ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей");
	КонецЕсли;
	
	Если ИспользоватьВиды Тогда
		
		ВидыСЗаявками = РаботаСЗаявками.ВидыЗаказовГдеСостояниеИспользуетЗаявки(Состояние);
		Если ВидыСЗаявками.Количество() Тогда
			
			ПредставленияВидов = Новый Массив;
			Для Каждого ВидСЗаявками Из ВидыСЗаявками Цикл
				ПредставленияВидов.Добавить(ВидСЗаявками.Представление);
			КонецЦикла;
			
			Если ПредставленияВидов.Количество() > 1 Тогда
				
				ПредставлениеВидов = ПредставлениеСпискаСтрокой(ПредставленияВидов);
				ТекстИсключения = СтрШаблон(
				НСтр("ru = 'Исключите состояние из видов заказов %1 перед удалением'"), ПредставлениеВидов);
				
			Иначе
				ТекстИсключения = СтрШаблон(
				НСтр("ru = 'Исключите состояние из вида заказа ""%1"" перед удалением'"), ПредставленияВидов[0]);
			КонецЕсли;
			
			ВызватьИсключение ТекстИсключения;
			
		КонецЕсли;
		
	Иначе
		ИсключитьСостояниеИзОсновногоВидаПередУдалением(Состояние);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИсключитьСостояниеИзОсновногоВидаПередУдалением(Состояние)
	
	ЭтоСостояниеЗаказНарядов = ЭтоСостояниеЗаказНарядов(Состояние);
	
	Если ЭтоСостояниеЗаказНарядов Тогда
		ВидЗаказовОбъект = Справочники.ВидыЗаказНарядов.Основной.ПолучитьОбъект();
	Иначе
		ВидЗаказовОбъект = Справочники.ВидыЗаказовПокупателей.Основной.ПолучитьОбъект();
	КонецЕсли;
	
	СтрокаССостоянием = ВидЗаказовОбъект.ПорядокСостояний.Найти(Состояние, "Состояние");
	Если СтрокаССостоянием = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидЗаказовОбъект.СостояниеЗаявки = Состояние Тогда
		
		Если ВидЗаказовОбъект.НомерСостоянияЗаявки > 1 Тогда
			
			ВидЗаказовОбъект.НомерСостоянияЗаявки = ВидЗаказовОбъект.НомерСостоянияЗаявки - 1;
			ВидЗаказовОбъект.СостояниеЗаявки = 
			ВидЗаказовОбъект.ПорядокСостояний[ВидЗаказовОбъект.НомерСостоянияЗаявки - 1].Состояние;
			
		Иначе
			
			ЕстьЗаявки = РаботаСЗаявками.ЗаявкиИспользуются(ВидЗаказовОбъект.Ссылка);
			Если ЕстьЗаявки Тогда
				ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Отключите использование заявок для состояния ""%1""'"), Состояние);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ВидЗаказовОбъект.ПорядокСостояний.Удалить(СтрокаССостоянием);
	
	ВидЗаказовОбъект.ОбменДанными.Загрузка = Истина;
	ВидЗаказовОбъект.Записать();
	ВидЗаказовОбъект.ОбменДанными.Загрузка = Ложь;
	
КонецПроцедуры

Функция ПредставлениеСпискаСтрокой(СписокПредставлений)
	
	Результат = "";
	Для Каждого Представление Из СписокПредставлений Цикл
		Результат = СтрШаблон("%1, ""%2""", Результат, Представление);
	КонецЦикла;
	
	Возврат Сред(Результат, 3);
	
КонецФункции

Функция ЭтоСостояниеЗаказНарядов(Состояние)
	
	Возврат ТипЗнч(Состояние) = Тип("СправочникСсылка.СостоянияЗаказНарядов");
	
КонецФункции

#КонецОбласти
